{"_id":{"$oid":"6117708cffdb10caa0411514"},"name":"Steven Spielberg","bio":"Steven Allan Spielberg is an American film director, producer, and screenwriter. He began his career in the New Hollywood era, and is one of the most commercially successful directors in history.","birthyear":"1946","movies":["Ready Player One","Schindlers List","E.T.","Jurassic Park","Jaws"]}
{"_id":{"$oid":"6117708cffdb10caa0411515"},"name":"Clint Eastwood","bio":"Clinton Eastwood Jr. is an American actor, film director, composer, and producer. An Academy Award nominee for Best Actor, Eastwood won Best Director and Best Picture for his Western film Unforgiven (1992) and his sports drama Million Dollar Baby (2004).","birthyear":"1930","movies":["American Sniper","Sully","Gran Torino","Letters from Iwo Jima","Million Dollar Baby"]}
{"_id":{"$oid":"6117708cffdb10caa0411516"},"name":"Robert Zemeckis","bio":"Robert Lee Zemeckis is an American film director, film producer, and screenwriter who is frequently credited as an innovator in visual effects. He first came to public attention as the director of Romancing the Stone (1984) and the science-fiction comedy Back to the Future, as well as the live-action/animated comedy Who Framed Roger Rabbit (1988).","birthyear":"1951","movies":["Back to the Future 1-3","Cast Away","Forrest Gump","The Polar Express","A Christmas Carol"]}
{"_id":{"$oid":"6117708cffdb10caa0411517"},"name":"Martin Scorsese","bio":"Martin Charles Scorsese is an American film director, producer, screenwriter, and actor. One of the major figures of the New Hollywood era, he is widely regarded as one of the greatest and most influential directors in film history.","birthyear":"1942","movies":["Gangs of New York","Goodfellas","The Departed","The Aviator","Taxi Driver","Hugo"]}
{"_id":{"$oid":"6117708cffdb10caa0411518"},"name":"Gus Van Sant","bio":"Gus Green Van Sant Jr. is an American film director, producer, photographer and musician who has earned acclaim as both an independent and mainstream filmmaker.","birthyear":"1952","movies":["Goodwill Hunting","Elephant","Finding Forrester","Paranoid Park","Promised Land"]}
{"_id":{"$oid":"6117708cffdb10caa0411519"},"name":"Adam McKay","bio":"Adam McKay is an American film and television director, producer, screenwriter, and comedian. McKay began his career in the 1990s as a head writer for the NBC sketch comedy show Saturday Night Live for two seasons and is the co-founder of the Upright Citizens Brigade.","birthyear":"1968","movies":["The Big Short","Vice","Ant-Man","The Other Guys"]}
{"_id":{"$oid":"6117708cffdb10caa041151a"},"name":"Danny Boyle","bio":"Daniel Francis Boyle is an English film, television, and stage director and producer. He is known for his work on films including Shallow Grave, Trainspotting, The Beach, 28 Days Later, Sunshine, Slumdog Millionaire, 127 Hours, Steve Jobs and Yesterday.","birthyear":"1956","movies":["Slumdog Millionaire","Yesterday","Trainspotting","The Beach","Steve Jobs","127 Hours"]}
{"_id":{"$oid":"6117708cffdb10caa041151b"},"name":"Bong Joon Ho","bio":"Bong Joon-ho is a South Korean film director, producer and screenwriter. The recipient of three Academy Awards, His films are characterised by emphasis on social themes, genre-mixing, black humor, and sudden tone shifts.","birthyear":"1969","movies":["Parasite","Snowpiercer","Okja","The Host","Mother","Sea Fog"]}
{"_id":{"$oid":"6117708cffdb10caa041151c"},"name":"Peter Berg","bio":"Peter Berg is an American actor, director, writer, and producer. His directorial film works include the black comedy Very Bad Things (1998), the action comedy The Rundown (2003), the sports drama Friday Night Lights (2004), the action thriller The Kingdom (2007), the superhero comedy-drama Hancock (2008), the military science fiction war film Battleship (2012).","birthyear":"1964","movies":["Patriot's Day","Lone Survivor","Mile 22","Deepwater Horizon","Battleship","The Kingdom","Hancock"]}
{"_id":{"$oid":"6117708cffdb10caa041151d"},"name":"Rian Johnson","bio":"Rian Craig Johnson is an American film director, producer, and screenwriter. He made his directorial debut with the neo-noir mystery film Brick, which received positive reviews and grossed nearly $4 million on a $450,000 budget.","birthyear":"1973","movies":["Star Wars: The Last Jedi","Looper","Knives Out","Brick"]}
{"_id":{"$oid":"6117708cffdb10caa041151e"},"name":"Nancy Meyers","bio":"Nancy Jane Meyers is an American filmmaker. She wrote, produced, and directed numerous critically and commercially successful romantic comedy films, including The Parent Trap, What Women Want, Something's Gotta Give, The Holiday, It's Complicated, and The Intern.","birthyear":"1949","movies":["The Intern","The Parent Trap","Something's gotta Give","It's Complicated","What Women Want"]}
{"_id":{"$oid":"6117708cffdb10caa041151f"},"name":"Jon Lucas","bio":"Jonathan Lucas is an American film director and screenwriter. He is best known for his collaborative work with Scott Moore, which includes The Hangover, 21 & Over and Bad Moms.","birthyear":"1976","movies":["Bad Moms","Bad Moms 2","21 & Over","The Hangover","The Hangover 2","The Hangover 3"]}
